// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.
let num1 = +prompt('Введите первое число ');
let num2 = +prompt('Введите второе число');
if (num1 > num2) {
    console.log(num1);
} else if (num1 === num2) {
    console.log('Числа равны');
} else {
    console.log(num2);
}

//
//
// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
let numRoom = +prompt('Введите номер вашей квартиры');
if (1 >= numRoom <= 20) {
    document.write('Ваша квартира в 1-м подьезде')
} else if (20 > numRoom <= 48) {
    document.write('Ваша квартира во 2-м подьезде')
} else if (49 >= numRoom <= 90) {
    document.write('Ваша квартира в 1-м подьезде')
} else {
    'Введите другой номер'
}


// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
let ten = +prompt('Введите число')
if (ten === 10) {
    console.log("ВІРНО")
} else {
    console.log('НЕВІРНО')
}
//
// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
let temp = +prompt("Какая сегодня температура ?");
if (10 >= temp <= 22) {
    document.write('Ми йдемо ВЧИТИСЯ')
} else document.write('Сидимо вдома і вчимося ОНЛАЙН');


// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .
let victory = +prompt('Введите число от 1 до 5');
switch (victory) {
    case 1: {
        alert('Вы выиграли автомобиль')
    }
        break;
    case 2: {
        alert('Вы выиграли квартиру')
    }
        break;
    case 3 : {
        alert('Вы выиграли телефон')
    }
        break;
    case 4 : {
        alert('Вы выиграли мотоцикл')
    }
        break;
    case 5 : {
        alert('Вы выиграли тур по Украине ')
    }
        break;
}
