// - створити функцію яка приймає три числа та виводить найменьше. (Без Math.min!)

// function min(a, b, c) {
//     if (a < b && b < c) return a;
//     else if (a > b && b < c) return b;
//     else if (a > c && b > c) return c;
// }
//
// console.log(min(21, 22, 44));
//
// // - створити функцію яка приймає три числа та виводить найбільше. (Без Math.max!)
// function max(a, b, c) {
//     if (a > b && a > c) return a;
//     else if (a < b && b > c) return b;
//     else if (a < c && c > b) return c;
// }
//
// console.log(max(77, 888, 665))
// - створити функцію яка повертає найбільше число з масиву


// - створити функцію яка повертає найменьше число з масиву

// let min =[28, 75, 33, 38, 82, 12];
// function arrmin(minarr){
//     let gh=min[0];
//     for (let ghnum of gh) {
//         if (ghnum<gh){
//             gh=ghnum;
//         }
//
//     }
// return gh;
// }
//
// console.log(arrmin(min));
// - створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13


// let sum = [218, 75, 33, 38, 82, 22];
//
// function qq(sum1) {
//     let aa = 0;
//     for (i = 0; i < sum.length; i++) {
//         aa = aa + sum[i];
//     }
//     return aa;
// }
//
// console.log(qq(sum));
// - створити функцію яка приймає масив чисел та повертає середнє арифметичне його значень.
let sum1 = [218, 75, 33, 38, 82, 22];

function qq(sum) {
    let aa = 0;
    for (i = 0; i < sum1.length; i++) {
        aa = aa + sum1[i];
    }
    aa=aa/sum1.length;
    return aa;
}
//
// - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше (Math використовувати заборонено);

// - створити функцію яка заповнює масив рандомними числами

// (цей код генерує рандомні числа в діапазоні від 0 до 100 - Math.round(Math.random()*100)) та виводить його.
// - створити функцію яка заповнює масив рандомними числами в діапазоні від 0 до limit. limit - аргумент, який характеризує кінцеве значення діапазону.
// - Функція приймає масив та робить з нього новий масив в зворотньому порядку. [1,2,3] -> [3, 2, 1].
//
//
