// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).

// let zz = +prompt('Напиши число від 1 до 59')
// if (zz >= 1 && zz <= 15) {
//     document.write("1-ша четверть")
// }
// else if (zz > 15 && zz <= 30) {
//     document.write("2-га четверть")
// }
// else if (zz >30 && zz <=45) {
//     document.write('3-четверть')
// }
// else if (zz >45 && zz <=59) {
//     document.write('4-четверть')
// }
// else {
//     document.write('Ти впевнений???')
// }


//
//
// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).

// let day = +prompt('Какое сегодня число?')
// if(day >= 1 && day <=10 ) {
//         document.write('Это значит сейчас 1-я декада месяца!')
//     }
//     else if (day >10 && day <=20){
//         document.write('Это значит сейчас 2-я декада месяца!')
// }
//     else if (day > 20 && day <=31) {
//         document.write
//     ('Это значит сейчас 3-я декада месяца!')
// }
//     else {document.write ('Это фиаско))') }
// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
// let test = +prompt('Сколько будет 2+2 ?')
//  if (test === 4) {document.write('Правильно')}
//  else if (test !== 4) { document.write ('Неверно')}








// - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
let a = +prompt('Введіть число 1, 0 , -3');
 if (a !== 0){
     document.write(`Правильно`) }
 else {
  document.write(`Не правильно`)}
(a!==0)?document.write(`Правильно`):
    document.write(`Не правильно`)

 //- Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день
 let list = +prompt('Введите номер дня');
  switch (list){
      case 1 : document.write('Сегодня первый урок математика')
          break;
      case 2 :document.write('Исправить двойку')
          break;
      case 3 :document.write('Сегодня контольная по литературе')
          break;
      case 4 : document.write('Сходить в библиотеку')
          break;
      case 5 : document.write('Выучить стих на понедельник')
          break;
      case 6 : document.write('Сегодня не нужно в школу')
          break;
      case 7 : document.write('Завтра в школу')
          break;
      default:document.write(`Введите другой день`)
  }


// - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.
let year = +prompt('Введите год ')
if (year%4===0) {document.write(`Этот год высокосный`)}
else {document.write (`Этот год не высокосный`)}
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)

(+prompt(`Введите год`) % 4 === 0) ?
    console.log(`Этот год высокосный`) :
    console.log(`Этот год не высокосный`)

// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!


 let scoolname = prompt('Яка «офіційна» назва JavaScript?')
 if (scoolname==='ECMAScript') {document.write('Правильно!')}
 else if (scoolname !=='ECMAScript') {document.write('Не знаєте? ECMAScript!')}